In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['test1','test2',np.nan,'test3'])

In [4]:
string_data

0    test1
1    test2
2      NaN
3    test3
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
#等价于
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
cleaned = data.dropna(how= 'all')

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned = data.dropna(how= 'all',axis=1)

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0  1.042024       NaN       NaN
1 -0.914380       NaN       NaN
2 -0.027732       NaN -0.202596
3 -0.518880       NaN  0.267635
4  0.180199 -0.429932 -0.371757
5 -1.405390  0.326352  0.446112
6  0.660015 -0.306718 -0.839786

In [20]:
df.dropna()

          0         1         2
4  0.180199 -0.429932 -0.371757
5 -1.405390  0.326352  0.446112
6  0.660015 -0.306718 -0.839786

In [21]:
df.dropna(thresh=2)

          0         1         2
2 -0.027732       NaN -0.202596
3 -0.518880       NaN  0.267635
4  0.180199 -0.429932 -0.371757
5 -1.405390  0.326352  0.446112
6  0.660015 -0.306718 -0.839786

In [22]:
df.fillna(0)

          0         1         2
0  1.042024  0.000000  0.000000
1 -0.914380  0.000000  0.000000
2 -0.027732  0.000000 -0.202596
3 -0.518880  0.000000  0.267635
4  0.180199 -0.429932 -0.371757
5 -1.405390  0.326352  0.446112
6  0.660015 -0.306718 -0.839786

In [23]:
df.fillna({1: 0.5, 2: 0})#对不同列填充不同的值

          0         1         2
0  1.042024  0.500000  0.000000
1 -0.914380  0.500000  0.000000
2 -0.027732  0.500000 -0.202596
3 -0.518880  0.500000  0.267635
4  0.180199 -0.429932 -0.371757
5 -1.405390  0.326352  0.446112
6  0.660015 -0.306718 -0.839786

In [24]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.042024  0.000000  0.000000
1 -0.914380  0.000000  0.000000
2 -0.027732  0.000000 -0.202596
3 -0.518880  0.000000  0.267635
4  0.180199 -0.429932 -0.371757
5 -1.405390  0.326352  0.446112
6  0.660015 -0.306718 -0.839786

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.019092 -0.830917  0.473179
1  1.076401 -2.075678  0.228228
2 -1.495668       NaN -0.903534
3 -0.268325       NaN -1.001726
4  0.116703       NaN       NaN
5 -0.861853       NaN       NaN

In [26]:
df.fillna(method='ffill')

          0         1         2
0  1.019092 -0.830917  0.473179
1  1.076401 -2.075678  0.228228
2 -1.495668 -2.075678 -0.903534
3 -0.268325 -2.075678 -1.001726
4  0.116703 -2.075678 -1.001726
5 -0.861853 -2.075678 -1.001726

In [27]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.019092 -0.830917  0.473179
1  1.076401 -2.075678  0.228228
2 -1.495668 -2.075678 -0.903534
3 -0.268325 -2.075678 -1.001726
4  0.116703       NaN -1.001726
5 -0.861853       NaN -1.001726

In [28]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last') #keep last表示保留最后一个出现的

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [36]:
lowercased = data['food'].str.lower()

In [37]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)

In [39]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
data.replace([-999, -1000], [np.nan, 0])#可以是按位对应的两个list

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data.replace({-999: np.nan, -1000: 0})#也可以是字典

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [47]:
transform = lambda x: x[:4].upper()
data.index.map(transform)#index会返回一个index的引用

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [48]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [49]:
data.rename(index=str.title, columns=str.upper)#rename方法会重新创建一个df

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [50]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [52]:
import matplotlib.pyplot as plt

In [71]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [72]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [73]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [76]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [77]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)#将右侧改为开区间

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [78]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [79]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)#传入bin的数量,precision=2限定小数为两位

[(0.74, 0.96], (0.74, 0.96], (0.081, 0.3], (0.74, 0.96], (0.74, 0.96], ..., (0.52, 0.74], (0.52, 0.74], (0.3, 0.52], (0.74, 0.96], (0.52, 0.74]]
Length: 20
Categories (4, interval[float64]): [(0.081, 0.3] < (0.3, 0.52] < (0.52, 0.74] < (0.74, 0.96]]

In [80]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(0.703, 3.219], (-0.674, 0.00957], (0.00957, 0.703], (0.00957, 0.703], (0.00957, 0.703], ..., (-2.8979999999999997, -0.674], (-2.8979999999999997, -0.674], (0.703, 3.219], (-2.8979999999999997, -0.674], (0.703, 3.219]]
Length: 1000
Categories (4, interval[float64]): [(-2.8979999999999997, -0.674] < (-0.674, 0.00957] < (0.00957, 0.703] < (0.703, 3.219]]

In [81]:
pd.value_counts(cats)

(0.703, 3.219]                   250
(0.00957, 0.703]                 250
(-0.674, 0.00957]                250
(-2.8979999999999997, -0.674]    250
dtype: int64

In [83]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])#这个可以传入自定义的分位数（在数据中的比例数）

[(0.00957, 1.222], (-1.215, 0.00957], (0.00957, 1.222], (0.00957, 1.222], (0.00957, 1.222], ..., (-1.215, 0.00957], (-1.215, 0.00957], (1.222, 3.219], (-2.8979999999999997, -1.215], (0.00957, 1.222]]
Length: 1000
Categories (4, interval[float64]): [(-2.8979999999999997, -1.215] < (-1.215, 0.00957] < (0.00957, 1.222] < (1.222, 3.219]]

In [84]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028375    -0.001728     0.035750     0.006439
std       0.959409     0.994414     1.001854     0.965943
min      -3.955565    -2.801653    -3.280283    -3.121935
25%      -0.647772    -0.657375    -0.610990    -0.674620
50%       0.004624     0.012794     0.002760     0.024974
75%       0.598423     0.649807     0.688662     0.670816
max       2.976734     3.332118     3.238193     3.302969

In [85]:
col = data[2]
col[np.abs(col) > 3]

137    3.238193
154    3.084727
364   -3.280283
459    3.180928
563   -3.242846
Name: 2, dtype: float64

In [86]:
data[(np.abs(data) > 3).any(1)]#any函数传入参数，选出所有的**包含绝对值大于3的行**

            0         1         2         3
137 -0.858804 -2.243261  3.238193  0.607175
154  0.172385  1.191158  3.084727 -1.542118
203 -3.048723 -0.214385 -0.275153 -0.810694
351  0.137849  3.203357 -0.640540 -0.100357
364  1.776913  0.637569 -3.280283  0.895299
459  0.156557  0.541477  3.180928 -0.080068
563  2.374859 -1.785669 -3.242846  0.692588
646  2.367992  0.483490 -0.288111 -3.121935
667 -0.606319  3.332118  0.158987  0.003286
867  1.774996 -0.517267 -0.774223  3.302969
868 -3.955565 -0.114353  0.279885  1.215408
886  0.163707  0.252012  0.942717  3.132348

In [87]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.027370    -0.002264     0.035769     0.006126
std       0.955810     0.992719     0.998653     0.964146
min      -3.000000    -2.801653    -3.000000    -3.000000
25%      -0.647772    -0.657375    -0.610990    -0.674620
50%       0.004624     0.012794     0.002760     0.024974
75%       0.598423     0.649807     0.688662     0.670816
max       2.976734     3.000000     3.000000     3.000000

In [88]:
np.sign(data).head()#由sign函数生成值

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0 -1.0  1.0

In [89]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([3, 0, 2, 1, 4])

In [90]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [91]:
df.take(sampler)#从df中take出index为sampler的

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [92]:
df.sample(n=3)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [93]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)#采用可重复的方式进行采样，第一列为index，第二列为值
draws

4    4
3    6
4    4
0    5
4    4
1    7
1    7
1    7
0    5
4    4
dtype: int64

In [94]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [95]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [96]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [97]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [98]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [99]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)#构建虚拟？的标注数据

In [100]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [101]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|')) # 得到特定标签的列值
    dummies.iloc[i, indices] = 1 #由上一步的列值来进行标注为1

In [102]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [103]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [104]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [105]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [106]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [107]:
'::'.join(pieces)

'a::b::guido'

In [109]:
'guido' in val

True

In [110]:
val.index(',')

1

In [111]:
val.find(':') #find找不到时会返回-1 而index会返回一个异常

-1

In [112]:
val.index(':')

ValueError: substring not found

In [113]:
val.count(',')

2

In [115]:
val.replace(',', '::')

'a::b::  guido'

In [116]:
val.replace(',', '')

'ab  guido'

In [117]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [118]:
regex = re.compile('\s+') #预编译
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [119]:
regex.findall(text)#find正则的内容

['    ', '\t ', '  \t']

In [120]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [121]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [123]:
m = regex.search(text) #search只会返回第一个
m

In [124]:
text[m.start():m.end()]

'dave@google.com'

In [126]:
print(regex.match(text)) #match需要整个字符串匹配

None

In [127]:
print(regex.sub('REDACTED', text)) # 返回并替换

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [128]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' #这是一个带有分组功能的模式，使用圆括号将你想要的部分括起来就可以
regex = re.compile(pattern, flags=re.IGNORECASE)

In [131]:
m = regex.match('wesm@bright.net')
m

In [132]:
m.groups() #可以返回模式的各个部分组成的元组

('wesm', 'bright', 'net')

In [133]:
regex.findall(text) #对于有分组功能的正则

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [134]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [135]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)

In [137]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [150]:
data.describe()

count                   3
unique                  3
top       steve@gmail.com
freq                    1
dtype: object

In [139]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [140]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [141]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [142]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [144]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [147]:
data.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [148]:
data.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [146]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object